emacs/doom/config.org
** RSS
RSS reader
#+begin_src emacs-lisp
(custom-set-variables
 '(elfeed-feeds
   (quote
    (("https://www.reddit.com/r/linux.rss" reddit linux)
     ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
     ("https://hackaday.com/blog/feed/" hackaday linux)
     ("https://opensource.com/feed" opensource linux)
     ("https://linux.softpedia.com/backend.xml" softpedia linux)
     ("https://itsfoss.com/feed/" itsfoss linux)
     ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
     ("https://www.phoronix.com/rss.php" phoronix linux)
     ("http://feeds.feedburner.com/d0od" omgubuntu linux)
     ("https://www.computerworld.com/index.rss" computerworld linux)
     ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
     ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
     ("https://betanews.com/feed" betanews linux)
     ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
     ("https://distrowatch.com/news/dwd.xml" distrowatch linux)))))
#+end_src

* Autocomplete
#+begin_src emacs-lisp
(setq company-idle-delay 0.2
      company-minimum-prefix-length 3)
#+end_src
#+begin_src emacs-lisp
(after! company
  (setq company-minimum-prefix-length 2
        company-idle-delay 0.1))

#+end_src
* lsp
#+begin_src emacs-lisp
(after! lsp-ui
  (setq lsp-ui-sideline-enable nil
        lsp-ui-doc-include-signature t
        lsp-ui-doc-max-height 15
        lsp-ui-doc-max-width 100
        lsp-ui-doc-position 'at-point))

#+end_src

Para go tengo que instalar segun el link
[[https://stackoverflow.com/questions/61998389/full-ide-features-support-for-golang-in-doom-emacs][Solucion gopls]]

* Projectile
Setting projects folders

To open project SPC p p
To open treemacs SPC o p
|                           |   | Command |
|---------------------------+---+---------|
| Open Projectile           |   | SPC p p |
| Open treemacs             |   | SPC o p |
| Open Shell                |   | SPC o e |
| Open small Shell          |   | SPC o E |
| Open Recent               |   | SPC f r |
| Open Recent viseted files |   | SPC f R |


#+begin_src emacs-lisp
(setq projectile-project-search-path '("~/Sync/proyectos/programacion/01-projects/" "~/Sync/Org/"))
#+end_src

* Patches
#+begin_src emacs-lisp
;; Patch up the evil-org key map, so that org is usable with daemon
;; https://github.com/hlissner/doom-emacs/issues/1897
(after! evil-org
  (evil-define-key '(normal visual) evil-org-mode-map
    (kbd "TAB") 'org-cycle))
#+end_src
